// ***ДОМАШНЯ РОБОТА*** !!! Кожну відповідь обгрунтувати, записати у коменті пілся слова "Відповідь:"
// Дано:
const v1 = 4;
const v2 = 3;
const v3 = 10;

// Завдання №1. Чому дорівнює L1? Відповідь: L1=undefined томущо v2 не більше v3.А якщоб v2 було більше v3 то L1 дорівнювало 23
let L1;
if (v1 === 4 && v2 > v3 ) {
    L1 = 23;
}

// Завдання №2. Чому дорівнює L1? Відповідь: v3 більше v2 та v2 дорівнює 3. L1 = 13
if (v3 > v2 && v2 >= 3) {
    L1 = 13;
}

// Завдання №3. Враховуавти, що код вишче вже виконаний! Чому дорівнює L2? Відповідь: L1 більше v3 і це правда. L2 = 13
let L2 = 'abcd';
if (L1 > v3 && true) {
    L2 = 13;
}

// Завдання №4. Чому дорівнює L3? Якщо щось нетак - пояснити чому. Відповідь: const назавжди незміний тому. L3 = 45
const L3 = 45;
if (L1 > v3 && true) {
    L3 = 13;
} 

// Завдання №5. Чому дорівнює L1? Відповідь: v1 не відповідає 5 і дальше вже програма не дивитися тому L1 = "a"
if ((v1 !== 5) || (v3 > v2)) {
    L1 = 'a';
}

// Завдання №6. Чому дорівнює L1? Відповідь: Треба щоб хочаб щось тут було правдою - v2 дорівнює 3 тому L1 = "a"
if ((v2 > 3) || (v1 > v3)) {
    L1 = 123;
}