// 1. Написати функцію, яка приймає масив, що складається із чисел (довжиной не менше 5)
// якщо довжина менше 5 - виводимо повідомлення про це, якщо довжина більше або дорівнює 5 -
// ітеруємося по масиву і як тільки доходимо до 3го (індекс 3) елемента припиняємо ітерацію та виводимо
// цей елемент, як РЕЗУЛЬТАТ роботи функції.
const arr1 = [1,2,3,4,5,6];
// const arr2 = [5, 10, 15, 20, 50, 100];
for (let i = 0; i < arr1.length; i++) {
    if (arr1.length < 5) {
        console.log('довжина менше 5')
    } 
    else {
        while (i === 3) {
            console.log('el:',element)
            break;
        }
    }
    
}


