// 1. Написати функцію, яка приймає число, якщо воно більше 20, то повертаємо його,
// а якщо менше 20 - то виводимо його в консоль, зменшуємо на 2 і виводимо результат
// у консоль поки результат більше або дорівнює 4.
// Тобто має вивести у консоль 20, 18, 16, 14, 12, 10, 8, 6, 4

// Щоб зменшити число на 2, x=x-2, або 2 рази x--




// 2. В нас є масив "arr", перебрати увесь масив, та збільшити кожне число на 3, УСІ получені
// результати просумувати, результат зберегти у змінну
const arr = [1, 2, 3, 4, 5, 6, 7];




// 3. В нас є об'єкт "obj". Перебрати об'єкт та збільшити усі значення вдвічі.
const obj = {
    a: 1,
    b: 2,
    c: 3
};


// Приклад до завдання 3, розібрати уважно, тому що по факту це рішення, тут збільшення в 10
const obj2 = {
    a: 10,
    b: 20,
    c: 30
};
for (let x in obj2) {
    obj2[x] = obj2[x] * 10;
}
console.log(obj2);
