// Контрольна робота. Кожне завдання оформити як функцію.

// Задача №1. Приймає число, перетворює його на строку та додає до неї строку "ка". Результат не повертається, а виводиться у консоль.


// Задача №2. Приймає строку, якщо довжина строки більше ніж 3 - виводимо у консоль першу літеру, а якщо довжина строки більше 3 - виводимо у консоль другий за індексом елемент.
// * Взяти літеру двома способами.


// Задача №3. Приймає строку, довжиною більше 4, бере перші 3 літери, переводить у верхній регістр та повертає результат.


// Задача №4. Приймає два числа, повертає найменше з них.


// Задача №5. Приймає два числа, якщо хоча б одно з них кратне 5 - збільшує його двічі та повертає.


// Задача №6. Приймає масив будь-яких елементів, перебирає його та повертає новий масив лише з чисел.


// Задача №7. Виводить у консоль числа з 0 до 10.


// Задача №8. Приймає іншу функцію, результат роботи якої виводить у консоль, не повертає його! повертає повідомлення, що функція виконана(не у консоль, а саме повертає результат).


// Задача №9**. Приймає масив функцій, але виконує лише першу і завершую свою роботу, нічого не виводить, не повертає.


// Задача №10**. Приймає функцію і виконує її 5 разів поспіль.


