// Завдання №1. Написати функцію: Якщо число кратне 3(трьом), 
// функція збільшує його вдвічі та повертає, якщо ні - результат НЕ ПОВЕРТАЄ, 
// а лише виводить у консоль це число.




// Завдання №2. Написати функцію з використанням switch-case. 
// Функція приймає число (1, 2 або 3), якщо це 1 - збільшує вдвічі і повертає, 
// якщо 2 - просто повертає його, якщо 3 - перетворює на строку та повертає.


function example (k) {
    let result;
    switch (k) {
        case 4:
            result = 4 * 5;
            break;
    
        case 5:
            result = 5 * 2;
            console.log('Це число 5!');
            break;

        default:
            result = 0;
            console.log('Це не 5 і не 4');
            break;
    }
    return result;
}

console.log(example(4));
