// Глобальний об'єкт - вбудований об'єкт JavaScript, призначений для важливої мети: властивості цього об'єкту
// є глобальними сутностями, доступними в будь-якому місці програми.

// Конструктор Error створює об'єкт помилки. Примірники Errorоб'єкта викидаються при виникненні помилок під час 
// виконання. Об'єкт Error також може використовуватися як базовий для винятків. Дивіться нижче стандартні типи помилок.


const myErr = new Error('Моя помилка.');
const myErrType = new TypeError('Неприпустимий тип.');

function getNumber(x) {
    if (typeof x === 'number') {
        console.log('x: ', x);
    } else {
        // console.log(myErr);
        throw myErr;
    }
}

getNumber(4);
getNumber('abc');


// Конструкція try...catch намагається виконати інструкції у блоці try, та, у випадку помилки, виконує блок catch.
