const myVariable = 10; // нельзя потом изменить
let mySecondVar = 5; // можно изменить
var myThirdVar = 1; // также можно изменить

console.log('Вивели месседж у консоль.');
console.log(mySecondVar); // вивели лише значення змінної
console.log('Змінна myVariable дорівнює ', myVariable);

// Коли ми передаємо у консоль декілька значеннь, перелічуючи їх через кому, як у прикладі вище
// Інтерпретатор(сама програма) виконує конкатенацію, тобто "зклеює" строки
// саме тому ось тут - 'Змінна myVariable дорівнює ' - у кінці пробіл, бо інакше значення myVariable
// буде одразу приклеєне до строки і отримаємотакий результат - Змінна myVariable дорівнює10

// Другий момент. Кількість пробілів після/перед перелічувальним елементом не має значення, інтерпретатор їх проігнорує
// Ці пробіли використовуються лише за для естетичного вигляду написаного коду; для розуміння, що в середині
// console.log у нас перелічено кілька елементів інтерпретатор потребує лише розділяти їх комою.


let b; // при объявлении переменной через "let" значение(первичное) указывать не обязательно, будет undefined
