// Модуль Math - представляет набор функций и констант
const pi = Math.PI; // тут представляет константу - число Пи
const random = Math.random(); // А тут функция генерации случайного числа в диапазоне от 0 до 1

// Деление на ноль не считается ошибкой. Вернется Infinity или -Infinity
// Но если поделить 0 на 0 возвращает специальное значение NaN (not a number)
const nanVar = 0/0;
console.log('Получено не число: ', nanVar);

const test1 = 2 + 2;
const div1 = 4/2; // возвращает результат
console.log('div1: ', div1);
const div2 = 7%3; // возвращает остаток. 5/2 это 2 и 1 в остатке
console.log('div2: ', div2);
let inc1 = 9;
inc1++;
console.log('инкремент: ', inc1); // инкремент
inc1--;
inc1--;
inc1--;
console.log('декремент: ', inc1); // декремент

const a1 = 2;
console.log(a1 == 2); // Проверка на соответствие значению
console.log(a1 != 2); // Проверка на несоответствие значению
console.log(a1 === 2); // Проверка на строгое соответствие значению
console.log(a1 !== 2); // Проверка на строгое несоответствие значению

console.log(a1 > 1);
console.log(a1 >= 2);
console.log(a1 < 23);


let a; // undefined -> не визначено
const b = 3;
const c = 4;
const d = 10;
const e = 20;

// Логічний оператор "І"
if (e === 20) { // через оператор "IF"
    a = 789;
}

// через логічний вираз є можливість записати до змінної "а" 
// значення 789, але не бажано, тому що, у випадку якщо хоча б одна умова не буде виконана
// зміна "а" стане false, тобто буде "зламана"
a = (e === 20) && 789;

if (b === 3) {
    if (c === 4) {
        if (d === 10) {
            a = 100;
        }
    }
}

// можна писати у одну стрічку якщо остання частина є дією.
(b === 3) && (c === 4) && (d !== 10) && console.log('OK');

// Првильне використання комплексної умови для запису значення змінної
if ((b === 3) && (c === 4) && (d === 10)) {
    a = 100;
}
console.log('a: ', a);


// Логічний оператор "АБО"
let x;

if ((c === 5) || (e > d) && (d === 11)) {
    x = 101;
}
console.log('x: ', x);

// Унарний оператор "!"
const y = (c !== 5) || (x === 101);
console.log('Результат: ', !y);
